{
  "main": {
    "name": "Jeremy E. Jefferson",
    "description": "Front-End Developer ⫸ Mastery in React, JavaScript, HTML, & CSS | Specialist in UI/UX Design | Adept at TypeScript, Node.js, Express, AngularJS, Vue.js, & MySQL",
    "image": "profilepic.jpg",
    "bio1": "Innovative and driven front-end developer with a background in illustration and over 4+ years of experience, specializing in UI/UX design and project management, mastery in React, JavaScript, HTML, and CSS, adept at TypeScript, Node.js, Express, AngularJS, Vue.js, and MySQL. Possesses an indomitable foundation in front-end development through Fullstack Academy training, eager to apply a creative edge and technical expertise with meticulous attention to detail to contribute to project success. Endeavors to utilize keen interpersonal skills and efficacious communication to be collaborative and task-driven. Highly adaptable and capable self-starter, able to move seamlessly throughout the development lifecycle—including developing strategies, wireframes, mockups, branding guidelines, prototyping solutions, testing criteria (A/B testing), and knowledge transfer.",
    "bio2": "Notable contributions include developing responsive websites for 40+ clients and tailoring each site to meet individual clients' unique branding and user experience requirements. Implementing isomorphic React and Node.js for 40+ web applications, significantly decreasing load times by 58% and enhancing overall user experience. Optimizing code for rendering components on UI, reducing HTTP requests by 70% for applications dealing with extensive data sets, such as e-commerce platforms and data analytics tools. Utilizing Object Oriented Programming concepts to develop reusable UI components, enhancing efficiency across various web applications. Spearheaded Agile/Scrum practices in multiple web development projects, conducting daily standup meetings to ensure transparent communication, track progress, and swiftly address challenges.",
    "contactmessage": "Get in touch! Whether you've got a query or simply want to discuss art, design, or tech, shoot me a message!",
    "email": "jeremyejefferson@gmail.com",
    "phone": "832-574-9862",
    "github": "https://github.com/Jeremy-Jefferson",
    "PROJECT": "https://github.com/Jeremy-Jefferson/Jeremy-Jefferson-Portfolio",
    "address": {
      "city": "Houston",
      "state": "Texas",
      "zip": "77027"
    },
    "website": "https://github.com/Jeremy-Jefferson",
    "resumedownload": "https://drive.google.com/file/d/1DVG5JBcIwEyN8kItzN1zq7HGNJd2sLO2/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/jeremyejefferson/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/Vagrant_Mugen",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/jeremyejefferson/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/jeremyejefferson/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/Jeremy-Jefferson",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "MY CORE TECH STACK",
    "work": [
      {
        "company": "Organized.Systems",
        "title": "Front-End Developer",
        "years": "January 2016 - Present",
        "description": [
          "• Developed responsive websites for 40+ clients, tailoring each site to meet the unique branding and user experience requirements of individual clients.",
          "• Collaborated closely with clients to deliver highly customized, visually appealing websites that exceeded expectations.",
          "• Optimized code for rendering components on UI, reducing HTTP requests by 70% for applications dealing with extensive data sets, such as e-commerce platforms and data analytics tools.",
          "• Implemented efficient data caching mechanisms, resulting in faster page load times and a seamless user experience, particularly for data-intensive applications.",
          "• Implemented isomorphic React and Node.js for 40+ web applications, significantly decreasing load times by 58% and enhancing overall user experience.",
          "• Integrated modern web technologies, including Progressive Web App (PWA) features, improving website performance and user engagement, especially on mobile devices.",
          "• Utilized Object Oriented Programming concepts to develop reusable UI components, enhancing efficiency across various web applications.",
          "• Spearheaded Agile/Scrum practices in multiple web development projects, conducting daily standup meetings to ensure transparent communication, track progress, and swiftly address challenges.",
          "• Initiated and led regular sprint retrospectives, evaluating team performance, identifying bottlenecks, and implementing process improvements. Cultivated a culture of continuous learning and enhancement within the team.",
          "• Facilitated collaborative brainstorming sessions across diverse teams, bridging the gap between design and development; offered technical insights and expertise, resulting in cohesive, visually appealing, and user-friendly web applications."
        ]
      },
      {
        "company": "Stone & Brier",
        "title": "UI/UX Designer",
        "years": "January 2017 - January 2019",
        "description": [
          "Creative Direction and Client Collaboration",
          "Enhanced User Engagement:",
          "• Led brainstorming meetings and creative sessions for 3-5 branding and visual design clients, resulting in a 25% increase in user engagement across multiple projects.",
          "• Fostered a collaborative environment, encouraging the generation of innovative ideas and creative solutions to meet client requirements.",
          "Exceptional Design Craftsmanship:",
          "• Developed visually appealing and user-friendly interfaces, improving customer experiences and contributing to a 20% higher client satisfaction rate.",
          "• Ensured seamless integration of design aesthetics and usability, resulting in a cohesive and intuitive user interface design.",
          "UI/UX Consistency and Documentation",
          "Comprehensive Design Guidelines:",
          "• Maintained platform-wide consistency by meticulously documenting use cases and UI elements, ensuring a standardized user experience throughout the application.",
          "• Developed comprehensive design guidelines that improved collaboration among team members and expedited the design process by 30%.",
          "Agile/Scrum Collaboration and Technical Innovation",
          "Project-Specific Sprint Planning:",
          "• Collaborated with cross-functional teams to define project-specific sprint goals and plan iterations, aligning design objectives with project milestones and stakeholder expectations.",
          "• Employed technical proficiency to propose and implement innovative strategies, resulting in a 15% reduction in development time while maintaining design integrity.",
          "Effective Cross-Functional Communication:",
          "• Worked seamlessly with diverse team members, demonstrating strong communication and collaboration skills. Ensured the integration of design concepts into interactive web interfaces, enhancing the overall user experience."
        ]
      }
    ],
    "education": [
      {
        "school": "Fullstack Academy",
        "degree": "Web Development Bootcamp",
        "graduated": "OCTOBER 2023",
        "description": [
          "*Back-end development proficiency: Node.js, Express, Services, and APIs (REST API integration).",
          "*Front-end development proficiency: HTML5, CSS, JavaScript, Razor, Twig, Typescript, Bootstrap, React, Angular, Vue, jQuery, and WebXR.",
          "*Data systems proficiency: SQLite, PostgreSQL, Sequelize, MySQL, MongoDB.",
          "*Object-oriented programming and full-stack applications."
        ]
      },
      {
        "school": "Rocky Mountain College of Art + Design (RMCAD)",
        "degree": "Bachelor of Fine Arts - Illustration",
        "graduated": "JUNE 2016",
        "description": [
          "My journey through RMCAD's BFA Illustration program was a vibrant blend of traditional craftsmanship and innovative creativity. Across a dynamic curriculum spanning 123 credits, I honed my skills in graphic design, illustration, and visual storytelling.",
          "This program immersed me in a rich tapestry of mediums—from classic techniques like painting, drawing, and printmaking to explorations in metalworking, ceramics, photography, and emerging new media. It nurtured my creative voice and cultivated a deep appreciation for the expressive power of art.",
          "Beyond technique, RMCAD fostered a profound understanding of art's role in society. It honed my ability to translate ideas into visual narratives, emphasizing the fusion of artistic expression with societal relevance.",
          "Ultimately, this program equipped me not just with the tools to excel as an illustrator but instilled a holistic appreciation for art's dynamic relationship with contemporary life and diverse disciplines."
        ]
      }
    ],
    "skills": [
      {
        "name": "JavaScript",
        "level": "95%"
      },
      {
        "name": "ReactJS",
        "level": "95%"
      },
      {
        "name": "HTML & CSS",
        "level": "98%"
      },
      {
        "name": "TypeScript",
        "level": "90%"
      },
      {
        "name": "Node",
        "level": "95%"
      },
      {
        "name": "Express",
        "level": "92%"
      },
      {
        "name": "AngularJS",
        "level": "90%"
      },
      {
        "name": "Vue.js",
        "level": "85%"
      },
      {
        "name": "MySQL",
        "level": "90%"
      },
      {
        "name": "PostgreSQL",
        "level": "92%"
      },
      {
        "name": "MongoDB",
        "level": "85%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Stone & Brier General Store",
        "description": "An e-commerce store titled Stone & Brier General Store. created with create-react-app and ChakraUI, uses https://fakestoreapi.com/",
        "image": "S&B.png",
        "url": "https://stone-and-brier-general-store.vercel.app/Home"
      },
      {
        "title": "Dictonary React App",
        "category": "Dictionary React app with word search, phonetic pronunciation function, a word of the day, as well as a quote of the day. Results show multiple definitions, synonyms, word classes, and example sentences. Uses Dictionary API.",
        "image": "Dictionary.png",
        "url": "https://dictionary-react-app-rho.vercel.app/"
      }
    ]
  }
}
